waviot/NBFi_AX5043/DevKit-STM32-AX5043/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2018 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

//#include "stm32l0xx_hal.h"

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define SB2_Pin GPIO_PIN_13
#define SB2_GPIO_Port GPIOC
#define SB2_EXTI_IRQn EXTI4_15_IRQn
#define POWERLED_Pin GPIO_PIN_0
#define POWERLED_GPIO_Port GPIOH
#define LCD_PWR_Pin GPIO_PIN_1
#define LCD_PWR_GPIO_Port GPIOH
#define BACKLIGHT_Pin GPIO_PIN_0
#define BACKLIGHT_GPIO_Port GPIOA
#define SB1_Pin GPIO_PIN_4
#define SB1_GPIO_Port GPIOA
#define SB1_EXTI_IRQn EXTI4_15_IRQn
#define AX_SPI_SCK_Pin GPIO_PIN_5
#define AX_SPI_SCK_GPIO_Port GPIOA
#define AX_SPI_MISO_Pin GPIO_PIN_6
#define AX_SPI_MISO_GPIO_Port GPIOA
#define AX_SPI_MOSI_Pin GPIO_PIN_7
#define AX_SPI_MOSI_GPIO_Port GPIOA
#define AX_IRQ_Pin GPIO_PIN_0
#define AX_IRQ_GPIO_Port GPIOB
#define AX_IRQ_EXTI_IRQn EXTI0_1_IRQn
#define AX_SPI_CS_Pin GPIO_PIN_1
#define AX_SPI_CS_GPIO_Port GPIOB
#define LCD_A0_Pin GPIO_PIN_2
#define LCD_A0_GPIO_Port GPIOB
#define LCD_MOSI_Pin GPIO_PIN_3
#define LCD_MOSI_GPIO_Port GPIOB
#define LCD_CS_Pin GPIO_PIN_4
#define LCD_CS_GPIO_Port GPIOB
#define LCD_SCK_Pin GPIO_PIN_5
#define LCD_SCK_GPIO_Port GPIOB
#define LCD_RESET_Pin GPIO_PIN_6
#define LCD_RESET_GPIO_Port GPIOB
#define SB3_Pin GPIO_PIN_7
#define SB3_GPIO_Port GPIOB
#define SB3_EXTI_IRQn EXTI4_15_IRQn
#define SB4_Pin GPIO_PIN_8
#define SB4_GPIO_Port GPIOB
#define SB4_EXTI_IRQn EXTI4_15_IRQn
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
